# -*- coding: cp1251 -*-
def GetPhrase(text):
	if text == "Welcome":
		return "\U0001F525*Добро пожаловать**!*\U0001F525\n\nДавайте вместе исследуем мир олимпиад с помощью [Olympiad Explorer](http://t.me/Olympiad_Explorer_bot)!\n\nПодписывайтесь на [наш канал](http://t.me/OlympiadExplorer) и вступайте в [наш чат](http://t.me/OlympiadExplorerChat)."
	elif text == "Information":
		return "\U0001F9E0Я здесь, чтобы помочь вам быть в курсе предстоящих олимпиад.\n\n\U000023F0Я могу отправлять вам напоминания за 1, 3, 7, 14 и 30 дней до начала любой олимпиады.\n\n\U0001F3C6Кроме того, вы можете использовать меня, чтобы найти информацию о ближайших олимпиадах и общую информацию о олимпиадах."
	elif text == "InfoOlympiads":
		return "\U0001F4E1Данный раздел находится в разработке\n\n\U00002139На данный момент можете посетить info.bc-pf.org."
	elif text == "Settings":
		return "\U00002699Здесь вы можете настроить свои уведомления о олимпиадах по своему вкусу.\n\n\U0001F501Вы можете включить/выключить уведомления, выбрать предметы, для которых хотите получать уведомления и выбрать классы, для которых хотите получать уведомления. Настройка ваших параметров позволит вам получать только соответствующую информацию о олимпиадах, которая вам нужна.\n\n\U0001F3B6Давайте сделаем ваш опыт с олимпиадами как можно более персонализированным."
	elif text == "Subjects":
		return "\U0001F4DAЗдесь вы можете выбрать предметы, о которых будут приходить уведомления. Нажимая на кнопку в этом разделе, вы активируете отправление уведомлений о выбранном предмете.\n\n\U0001F47EНастраивайте уведомления по своему вкусу и не пропускайте важные олимпиады!"
	elif text == "Grades":
		return "\U0001F4DAЗдесь вы можете выбрать года обучения. Нажимая на кнопку в этом разделе, вы активируете отправление уведомлений о выбранном годе обучения.\n\n\U0001F47EНастраивайте уведомления по своему вкусу и не пропускайте важные олимпиады!"
	elif text == "Notifications":
		return "\U0001F4DAЗдесь вы можете включить/выключить уведомления, в случае отключения уведомлений они перестанут вам приходить.\n\n\U0001F47EНастраивайте уведомления по своему вкусу и не пропускайте важные олимпиады!"
	elif text == "DatesOlympiads":
		return "\U0001F4C5Здесь вы можете узнать о предстоящих мероприятиях и датах проведения. В этом разделе мы собираем всю информацию о сборах. олимпиадах и других мероприятиях, которые пройдут в ближайшее время.\n\n\U0001F5D2Будьте в курсе всех событий и не пропустите ничего интересного!"
	elif text.find("Notify30|") != -1:
		arr = text.split("|")
		return "\U0001F514Событие " + arr[1] + " пройдёт через месяц!\n\nУзнать больше о данном событии вы можете на [Форуме Спроси!](ask.bc-pf.org)"
	elif text.find("Notify14|") != -1:
		arr = text.split("|")
		return "\U0001F514Событие " + arr[1] + " пройдёт всего через две недели!\n\nУзнать больше о данном событии вы можете на [Форуме Спроси!](ask.bc-pf.org)"
	elif text.find("Notify7|") != -1:
		arr = text.split("|")
		return "\U0001F514Событие " + arr[1] + " пройдёт всего через неделю!\n\nУзнать больше о данном событии вы можете на [Форуме Спроси!](ask.bc-pf.org)"
	elif text.find("Notify3|") != -1:
		arr = text.split("|")
		return "\U0001F514Осталось всего несколько дней до события " + arr[1] + "!\n\nУзнать больше о данном событии вы можете на [Форуме Спроси!](ask.bc-pf.org)"
	elif text.find("Notify1|") != -1:
		arr = text.split("|")
		return "\U0001F514Событие " + arr[1] + " пройдёт уже завтра, не пропустите его!\n\nУзнать больше о данном событии вы можете на [Форуме Спроси!](ask.bc-pf.org)"
	return "Что-то пошло не так, пожалуйста сообщите об этом админу..."	